Конфигурация/src/Documents/ОтгрузкаКлиенту/ОтгрузкаКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаКлиенту</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ОстаткиПродукции/ОстаткиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ОтгрузкаКлиенту/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // *** 1. Инициализация и настройка ***
    Движения.ОстаткиПродукции.Записывать = Истина;
    Движения.ОстаткиПродукции.Очистить(); 
    
    ЕстьНехватка = Ложь;
    ТекстНехватки = "";
    
    // 1. Получение списка продукции для запроса остатков
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |    ОтгрузкаКлиентуПродукция.Продукция
    |ИЗ
    |    Документ.ОтгрузкаКлиенту.Продукция КАК ОтгрузкаКлиентуПродукция
    |ГДЕ
    |    ОтгрузкаКлиентуПродукция.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаПродукции = РезультатЗапроса.Выгрузить(); 
    СписокПродукции = ТаблицаПродукции.ВыгрузитьКолонку("Продукция");
    
    // Проверка на пустую ТЧ
    Если СписокПродукции.Количество() = 0 Тогда
        Отказ = Истина;
        Сообщить("Табличная часть Продукция пуста. Проведение отменено.");
        Возврат;
    КонецЕсли;
    
    // 2. Получение текущих остатков с защитой от NULL
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОстаткиПродукцииОстатки.Продукция,
    |    ЕСТЬNULL(ОстаткиПродукцииОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
    |    ЕСТЬNULL(ОстаткиПродукцииОстатки.СуммаОстаток, 0) КАК СуммаОстаток
    |ИЗ
    |    РегистрНакопления.ОстаткиПродукции.Остатки(
    |            &МоментВремени,
    |            Продукция В (&СписокПродукции)) КАК ОстаткиПродукцииОстатки";
            
    Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
    Запрос.УстановитьПараметр("СписокПродукции", СписокПродукции);
    
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
    
    // 3. Проверка остатков и формирование движений
    Для Каждого СтрокаТЧ Из Продукция Цикл
        
        // --- ГАРАНТИРОВАННЫЙ ПОИСК ЦИКЛОМ ---
        СтрокаОстатка = Неопределено;
        Для Каждого СтрокаОста Из ТаблицаОстатков Цикл
            Если СтрокаОста.Продукция = СтрокаТЧ.Продукция Тогда 
                СтрокаОстатка = СтрокаОста;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        // Значения по умолчанию
        Доступно = 0;
        СуммаОстаток = 0;
        
        // Если остаток найден, получаем данные
        Если СтрокаОстатка <> Неопределено Тогда
            Доступно = СтрокаОстатка.КоличествоОстаток;
            СуммаОстаток = СтрокаОстатка.СуммаОстаток;
        КонецЕсли;
        
        // 4. Проверка на достаточность остатка
        Если СтрокаТЧ.Количество > Доступно Тогда
            // Не хватило: фиксируем нехватку
            ЕстьНехватка = Истина;
            ТекстНехватки = ТекстНехватки 
                + "Не хватило " + СтрокаТЧ.Продукция.Наименование 
                + " (Требовалось: " + СтрокаТЧ.Количество 
                + ", Доступно: " + Доступно + "); ";
            // Движение для этой строки не создается
            
        Иначе
            // Расчет средней себестоимости для списания
            СписываемаяСумма = 0;
            Если Доступно > 0 Тогда
                СредняяСтоимость = СуммаОстаток / Доступно;
                СписываемаяСумма = СредняяСтоимость * СтрокаТЧ.Количество;
            КонецЕсли;
            
            // Создание движения Расход
            Движение = Движения.ОстаткиПродукции.Добавить();
            Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
            Движение.Период      = Дата;
            Движение.Продукция   = СтрокаТЧ.Продукция;
            Движение.Количество  = СтрокаТЧ.Количество;
            Движение.Сумма       = СписываемаяСумма; 
            
        КонецЕсли;
        
    КонецЦикла;
    
    // 5. Окончательное решение: если была хоть одна нехватка
	Если ЕстьНехватка Тогда
	    Движения.ОстаткиПродукции.Записывать = Ложь;
	    Движения.ОстаткиПродукции.Очистить();
	
	    ЭтотОбъект.Комментарий = ТекстНехватки;
	    // фиксируем комментарий в базе, но без движений
	    ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	    Сообщить("Внимание! Отгрузка зарегистрирована, но остатки не уменьшены из-за нехватки продукции.", СтатусСообщения.Важное);
	Иначе
	    ЭтотОбъект.Комментарий = "";
	КонецЕсли;

    
КонецПроцедуры
